---
kind: type
id: T:Autodesk.Revit.DB.Mechanical.DuctSizeSettings
source: html/68c1d227-424d-36da-0e5a-3f3e51e7f939.htm
---
# Autodesk.Revit.DB.Mechanical.DuctSizeSettings

Duct sizes settings

## Syntax (C#)
```csharp
public class DuctSizeSettings : Element,
	IEnumerable<KeyValuePair<DuctShape, DuctSizes>>
```